## 组件开发说明

### 1. 组件定义
组件是SoFlu全自动开发平台的精髓所在，与函数、流程、资源相配合可实现各种复杂功能。SoFlu全自动开发平台提供了基础、SQL、通信、工具、数据库、脚本语言等各种类型的组件，以帮助用户实现各种功能需求。同时平台也提供了组件的开发包及开发说明文档，当平台组件无法满足用户开发需求时，用户可以通过对入参、出参的定义，衔接整体流程，开发出能实现特定功能的组件。

### 2. 组件设计原则
为了开发出满足特定功能的组件，用户需要先了解组件的设计原则，主要分为以下六点：

#### 2.1 解决共性问题
在需求实现中，对重复出现、有相似性的问题进行总结分析，剥离各问题的特性，抽象出共性，确定组件要解决的问题，而非个性问题。

#### 2.2 不依赖特定环境，具有普适性
组件运行环境基于JDK版本，可能运行的环境包括各种操作系统，功能不能只适配某特定环境，应适应多种目标环境。

#### 2.3 配置信息与平台资源契合
按平台资源实例所定义资源的规范标准，开发组件中需要的配置项。

#### 2.4 性能优化，最佳实践
对比测试各种实现方式后，采取最优策略来实现功能，不能为了追求开发速度，牺牲组件的性能。

#### 2.5 健壮性，异常处理合理性
组件应用到平台后，会运行在各类复杂环境，在异常处理中需充分考虑，返回合理的异常，返回消息时明确组件内部处于何种状态。

#### 2.6 质量与安全
需确保组件代码及引用的相关JAR包，均通过了相关漏洞测试，安全审核；在代码质量上起码要达到平台要求，同时追求高质量代码。

### 3. 组件开发
本节将以开发解压组件为例，详细描述组件的开发步骤。

#### 3.1 开发步骤

##### 步骤 1
进入全自动开发平台项目管理页面，单击右上角下载按钮，进入“开发辅助工具”页面，如图3-1所示。

![3-1](https://images.gitee.com/uploads/images/2021/0830/112634_726eb064_8721401.png "3_1.png")
###### 图3-1 项目管理页面

##### 步骤 2	
在开发辅助工具页面，单击“加载项开发包”选项卡，如图3-2所示。

![3-2](https://images.gitee.com/uploads/images/2021/0830/113119_2395dbb9_8721401.png "3_2.png")
###### 图3-2 开发辅助工具页面

##### 步骤 3	
左下角会显示正在下载加载项开发包“feisuanyz-cmpt.zip”，如图3-3所示。

![3-3](https://images.gitee.com/uploads/images/2021/0830/113555_5d5900a9_8721401.png "3_3.png")
###### 图3-3 显示正在下载

##### 步骤 4	
下载完成之后，将开发包解压到固定目录下，如图3-4所示。

![3-4](https://images.gitee.com/uploads/images/2021/0830/113708_c1b6d4bc_8721401.png "3_4.png")
###### 图3-4 解压开发包

##### 步骤 5	
创建自己的Java项目工程，编辑pom.xml文件，在pom.xml文件中添加上一步中得到的Jar包，如图3-5所示。

![3-5](https://images.gitee.com/uploads/images/2021/0830/113810_0be3128b_8721401.png "3_5.png")
###### 图3-5 添加Jar包（说明：systemPath标签需要改成自己开发工具包解压目录）

##### 步骤 6	
创建好自己的项目结构，新建Class，实现FlowComponet接口中的execute方法，如图3-6所示。

![3-6](https://images.gitee.com/uploads/images/2021/0830/113942_3979bf51_8721401.png "3_6.png")
###### 图3-6 新建Class实现execute方法（说明：execute方法中为功能实现代码）

##### 步骤 7	
在resources目录下创建components.xml文件，此文件用来描述组件属性，如图3-7所示。

![3-7](https://images.gitee.com/uploads/images/2021/0830/114018_9bec8628_8721401.png "3_7.png")
###### 图3-7 创建components.xml文件

具体代码如下：

![具体代码1](https://images.gitee.com/uploads/images/2021/0830/114219_1e446546_8721401.png "具体代码1.png")
![具体代码2](https://images.gitee.com/uploads/images/2021/0830/114231_f707d067_8721401.png "具体代码2.png")
###### 说明：具体信息可参考飞算开发者学院（ https://www.feisuanyz.com/support ）中的“文档中心-高阶专题-自定义组件”章节，内有详细介绍

##### 步骤 8	
在resources目录下创建META-INF\services文件夹，在services目录中创建com.feisuanyz.flow.component.FlowComponent文件，如图3_8所示。

![3-8](https://images.gitee.com/uploads/images/2021/0830/140159_a3a90f6e_8721401.png "3_8.png")
###### 图3-8 创建com.feisuanyz.flow.component.FlowComponent文件

### 4. 组件打包
#### 4.1 操作步骤

##### 步骤 1	
用IDEA打包，双击“install”打成jar包，如图4-1所示。

![5-1](https://images.gitee.com/uploads/images/2021/0830/140655_b80714bc_8721401.png "5_1.png")
###### 图4-1 打jar包

##### 步骤 2	
将jar、pom文件一起压缩成zip包，如图4-2所示。

![5-2](https://images.gitee.com/uploads/images/2021/0830/140740_e611ef60_8721401.png "5_2.png")
###### 图4-2 压缩成zip包

##### 步骤 3	
将代码与打包好的压缩包上传到指定目录，由官方人员审核并进行相应操作。

### 5. 组件升级迭代
当组件需要升级迭代时，会对代码进行修改，这时用户需要对pom文件中的版本号进行相应修改后重新打包，审核，如图5-1所示。

![6-1](https://images.gitee.com/uploads/images/2021/0830/140938_2c29ea5b_8721401.jpeg "6_1.jpg")
###### 图5-1 组件版本升级
